import 'package:easy_localization/easy_localization.dart';
import 'package:flutter_widget_from_html/flutter_widget_from_html.dart';
import 'package:flutter/material.dart';

class PrivacyPolicyScreen extends StatefulWidget {
  static String id = "/PrivacyPolicyScreen";

  @override
  State<PrivacyPolicyScreen> createState() => _PrivacyPolicyScreenState();
}

class _PrivacyPolicyScreenState extends State<PrivacyPolicyScreen> {
  @override
  void initState() {
    // TODO: implement initState
    super.initState();
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.white,
        appBar: AppBar(
          automaticallyImplyLeading: true,
          backgroundColor: Colors.white,
          elevation: 0,
          title: Text(
            "سياسة الخصوصية والاستخدام",
            style: TextStyle(
              decoration: TextDecoration.underline,
              fontFamily: 'pnuB',
              fontSize: 15,
              color: Colors.black,
              fontWeight: FontWeight.w700,
            ),
            textAlign: TextAlign.left,
          ),
          leading: IconButton(
            onPressed: () {
              Navigator.of(context).pop();
            },
            icon: Icon(
              Icons.arrow_back,
              color: Colors.black,
            ),
          ),
        ),
        body: Padding(
          padding: const EdgeInsets.all(20.0),
          child: SingleChildScrollView(
            child: HtmlWidget(
              kHtmlAr,
              textStyle: TextStyle(fontSize: 14, color: Colors.black),
            ),
          ),
        ));
  }
}

const kHtmlAr = """


<p>

اعتمد داندون سياسة الخصوصية هذه ("سياسة الخصوصية") لشرح كيفية قيام داندون بجمع وتخزين واستخدام المعلومات التي تم جمعها فيما يتعلق بخدمات دندن.





من خلال تثبيت الخدمات أو استخدامها أو التسجيل فيها أو الوصول إليها بأي طريقة أخرى ، فإنك توافق على سياسة الخصوصية هذه وتعطي موافقة صريحة ومستنيرة لمعالجة بياناتك الشخصية وفقًا لسياسة الخصوصية هذه. إذا كنت لا توافق على سياسة الخصوصية هذه ، فيرجى عدم تثبيت الخدمات أو استخدامها أو التسجيل فيها أو الوصول إليها بأي طريقة أخرى. تحتفظ Dandoun بالحق في تعديل سياسة الخصوصية هذه في أوقات معقولة ، لذا يرجى مراجعتها بشكل متكرر. إذا قام داندون بإجراء تغييرات مادية أو مهمة على سياسة الخصوصية هذه ، يجوز لـ Dandoun نشر إشعار على موقع Dandoun الإلكتروني جنبًا إلى جنب مع سياسة الخصوصية المحدثة. إن استمرارك في استخدام الخدمات يعني موافقتك على التغييرات التي تطرأ على سياسة الخصوصية هذه.




البيانات غير الشخصية





لأغراض سياسة الخصوصية هذه ، تعني "البيانات غير الشخصية" المعلومات التي لا تحدد هويتك بشكل مباشر. تشمل أنواع البيانات غير الشخصية التي قد تجمعها Dandoun وتستخدمها ، على سبيل المثال لا الحصر: خصائص التطبيق ، بما في ذلك ، على سبيل المثال لا الحصر ، اسم التطبيق واسم الحزمة والأيقونة المثبتة على جهازك. سيتم الكشف عن تسجيل الوصول الخاص بك (بما في ذلك مثل ، التوصية) للعبة لجميع Dandounusers.





يجوز لشركة Dandoun استخدام البيانات غير الشخصية التي تم جمعها والإفصاح عنها لشركاء MoApps والمتعاقدين معها لأغراض تحليل استخدام الخدمات ، وخدمة الإعلان ، وإدارة الخدمات وتقديمها ، ومواصلة تطوير الخدمات وغيرها من خدمات ومنتجات Dandoun.





أنت تقر وتوافق على أن شركات التحليلات التي تستخدمها Dandoun قد تجمع المعلومات التي تم جمعها مع المعلومات الأخرى التي جمعوها بشكل مستقل من الخدمات أو المنتجات الأخرى المتعلقة بأنشطتك. تجمع هذه الشركات المعلومات وتستخدمها بموجب سياسات الخصوصية الخاصة بها.





بيانات شخصية





لأغراض سياسة الخصوصية هذه ، تعني "البيانات الشخصية" معلومات التعريف الشخصية التي تحدد هويتك على وجه التحديد كفرد.





المعلومات الشخصية التي تم جمعها بواسطة معلومات Dandoun التي قدمتها لنا طواعية عند إنشاء حسابك أو تغيير حسابك





معلومة. تتضمن المعلومات معرف facebook والاسم والجنس والموقع وأصدقائك على facebook. يقوم Dandounalso بتخزين عمليات تسجيل الوصول للعبة الخاصة بك ، ويحب ، ويكره ، والتوصيات والرسائل.





قد تستخدم Dandoun البيانات الشخصية المجمعة لأغراض تحليل استخدام الخدمات ، وتوفير الدعم للعملاء والدعم الفني ، وإدارة وتقديم الخدمات (بما في ذلك إدارة خدمة الإعلانات) ومواصلة تطوير الخدمات وغيرها من خدمات ومنتجات Dandoun. قد يجمع داندون بين البيانات غير الشخصية والبيانات الشخصية.





يرجى ملاحظة أن بعض ميزات الخدمات قد تكون قادرة على الاتصال بمواقع الشبكات الاجتماعية الخاصة بك للحصول على معلومات إضافية عنك. في مثل هذه الحالات ، قد يكون داندون قادرًا على جمع معلومات معينة من ملفك الشخصي على الشبكات الاجتماعية عندما يسمح لك موقع التواصل الاجتماعي الخاص بك بذلك ، وعندما توافق على السماح لموقعك على شبكة التواصل الاجتماعي بإتاحة هذه المعلومات إلى MoApps. قد تتضمن هذه المعلومات ، على سبيل المثال لا الحصر ، اسمك وصورة ملفك الشخصي والجنس ومعرف المستخدم وعنوان بريدك الإلكتروني وبلدك ولغتك ومنطقتك الزمنية والمؤسسات والروابط الموجودة على صفحة ملفك الشخصي وأسماء وصور ملفك الشخصي. موقع "الأصدقاء" على شبكة التواصل الاجتماعي الخاص بك والمعلومات الأخرى التي قمت بتضمينها في ملف تعريف موقع الشبكة الاجتماعية الخاص بك. قد تكون شركة Dandounmay شريكًا و / أو تجمع وتستخدم أيضًا المعلومات التي تم جمعها بواسطة Dandounand / أو التي تم الحصول عليها من خلال مواقع الشبكات الاجتماعية هذه وفقًا لسياسة الخصوصية هذه.





إفشاء ونقل البيانات الشخصية





يقوم Dandouncn بجمع ومعالجة البيانات الشخصية على أساس طوعي وليس في مجال بيع بياناتك الشخصية إلى أطراف ثالثة. ومع ذلك ، قد يتم الكشف عن البيانات الشخصية في بعض الأحيان وفقًا للتشريعات المعمول بها وسياسة الخصوصية هذه. بالإضافة إلى ذلك ، قد تكشف Dandounmay عن البيانات الشخصية لشركاتها الأم والشركات التابعة لها وفقًا لسياسة الخصوصية هذه.





قد تقوم Dandounmay بتوظيف وكلاء ومقاولين لجمع ومعالجة البيانات الشخصية نيابة عن MoApps وفي مثل هذه الحالات سيتم توجيه هؤلاء الوكلاء والمقاولين للامتثال لسياسة الخصوصية الخاصة بنا واستخدام البيانات الشخصية فقط للأغراض التي تم إشراك الطرف الثالث من أجلها بواسطة MoApps . لا يجوز لهؤلاء الوكلاء والمقاولين استخدام بياناتك الشخصية لأغراض التسويق الخاصة بهم. قد تستخدم Dandoun موفري خدمات من جهات خارجية مثل معالجات بطاقات الائتمان ومقدمي خدمات البريد الإلكتروني ووكلاء الشحن ومحللي البيانات ومقدمي استخبارات الأعمال. يحق لدندون مشاركة بياناتك الشخصية عند الضرورة للأطراف الثالثة المذكورة أعلاه لتقديم خدماتهم إلى MoApps. دندوني غير مسؤول عن أفعال وإغفالات هذه الأطراف الثالثة ، باستثناء ما ينص عليه القانون الإلزامي.


</p>



""";
